Repository: LRunt/Note-appliaction
Catalog: notes/lib/l10n/app_*.arb
Languages: cs

# welcome
source: Welcome back!
cs: Vítej zpět!

source: File is empty
cs: Složka je prázdná

source: Registration
cs: Registrovat

source: Login
cs: Přihlásit

source: Username
cs: Přezdívka

source: Password
cs: Heslo

# passwordConfirm
source: Confirm password
cs: Potvrďte heslo

# loginText
source: Please Login
cs: Přihlašte se

# doNotHaveAccount
source: Don't have an acount?
cs: Nemáte založený účet?

# createAccount
source: Create new here!
cs: Založte si nový zde!

# registrationText
source: Let's create an acount
cs: Založte si nový účet

# haveAccount
source: Have an acount?
cs: Máte založený účet?

source: Login here!
cs: Přihlašte se zde!

# notLogged
source: Not logged user
cs: Nepřihlášený uživatel

source: Sign out
cs: Odhlásit se

# loggedUser
source: Logged user: {userEmail}
cs: Přihlášený uživatel: {userEmail}

# newNode
source: Create new note/directory
cs: Vytvořit novou poznámku/složku

# deleteNode
source: Delete {nodeName}
cs: Smazat {nodeName}

# renameNode
source: Rename {nodeName}
cs: Přejmenovat {nodeName}

source: CANCEL
cs: STORNO

source: CREATE
cs: VYTVOŘ

source: DELETE
cs: SMAZAT

source: RENAME
cs: PŘEJMENUJ

source: MOVE
cs: PŘESUŇ

# deleteContent
source: Are you sure to delete {nodeName} node?
cs: Jste si jistí, že chcete smazat {nodeName}?

# menuDelete
source: Delete
cs: Smazat

# menuRename
source: Rename
cs: Přejmenovat

# menuCreate
source: Create children
cs: Nová poznámka/složka

# createNote
source: New note
cs: Nová poznámka

# createFile
source: New file
cs: Nová složka

# menuMove
source: Move
cs: Přesunout

# networkRequestFailed
source: No internet connection
cs: Bez internetového připojení

# invalidEmail
source: Wrong format of email
cs: Špatný formát e-mailové adresy

source: Wrong password
cs: Špatné heslo

# userNotFound
source: No user found with that email
cs: Nebyl nalezen žádný uživatel s touto e-mailovou adresou

# invalidCreditial
source: Wrong email or password
cs: Špatná e-mailová adresa nebo heslo

# weakPassword
source: Password is too short. Password must have at least 6 chars.
cs: Heslo je příliš krátké. Heslo musí mít nejméně 6 znaků.

# accountWithEmailExists
source: An account already exists for that email.
cs: Pro tuto e-mailovou adresu již existuje účet.

# differentPasswords
source: Passwords are not same.
cs: Hesla se neshodují.

# fieldsAreNotFilled
source: One or more fields are not filled!
cs: Jedno nebo více textových polí je prázdné!

# googleSignFailed
source: Google sign in failed
cs: Přihlášení Google účtem selhalo.

source: Settings
cs: Nastavení

source: Language
cs: Jazyk

source: Logs
cs: Logy

source: SHOW LOGS
cs: UKAŽ LOGY

# deleteLogs
source: Clear logs
cs: Smazat logy

# deleteLogsContent
source: You are going to delete all logs
cs: Chystáte se smazat všechny logy aplikace

source: Delete application data
cs: Smazat lokální data aplikace

# deleteAppDataDialogTitle
source: Delete application data
cs: Smazat data aplikace

# deleteAppDataDialogContent
source: Are you sure you want to delete all application data? All data will be lost!
cs: Právě se chystáte smazat všechna data z lokální databáze. Všechna nesynchronizovaná data budou ztracena!

# emptyFile
source: File is empty
cs: Adresář je prázdný

# toParentNode
source: To parent directory
cs: O úroveň výš

# deleteDataSuccess
source: All data was successfully deleted
cs: Všechna data úspěšně smazána

# clearLogsSuccess
source: All logs was cleared
cs: Všechny logy úspěšně smazány

source: Synchronize
cs: Synchronizace

source: Show conflicts
cs: Zobrazit konflikty

source: SHOW
cs: ZOBRAZ

source: Conflicts
cs: Konflikty

source: Replace
cs: Nahradit

# googleSignDivider
source: Other authentification methods
cs: Ostatní metody autentifikace

# forgotPassword
source: Forgot your password?
cs: Zapomenuté heslo?

# resetPassword
source: Click for reset
cs: Obnovit heslo

# resetPasswordTitle
source: Reset password
cs: Obnovení hesla

# resetInstructions
source: Enter your email. We will send you an email for reseting the password.
cs: Zadejte svůj e-mail. Bude vám zaslán e-mail s odkazem na obnovení hesla.

# sendResetEmail
source: Send email
cs: Odeslat e-mail

# emailSentToast
source: Email has been sent
cs: E-mail pro obovení hesla byl odeslán

source: LOCK
cs: UZAMKNOUT

# lockNode
source: Lock {noteName}
cs: Uzamknout {noteName}

# unlockNode
source: Unlock {noteName}
cs: Odemknout {noteName}

source: UNLOCK
cs: ODEMKNOUT

# unlockMenu
source: Odemnknout
cs: Odemknout

# siblingWithSameNameToast
source: In destination is folder or note with same name
cs: V umístění se nachází soubor se stejným jménem

# emptyTextFieldToast
source: Empty textfield
cs: Prázdné pole s názvem

# disabledCharsToast
source: Name contains one of disabled char: | or /
cs: Název obsahuje jeden ze zakázaných znaků: | or /

# lastSynchronization
source: Last synchronization: {lastSync}
cs: Poslední synchronizace: {lastSync}

source: CLOSE
cs: ZAVŘÍT

source: Open
cs: Otevřít

source: Dark mode
cs: Tmavý mód

# aboutApp
source: About application
cs: Informace o aplikaci

# informationsAboutApp
source: Note-taking application Author: Lukáš Runt Version: 1.0.5 Publish date: 16. 04. 2024
cs: Aplikace pro tvorbu poznámek Autor: Lukáš Runt Verze: 1.0.5 Datum vydání: 16. 04. 2024

# lockButton
source: Lock
cs: Uzamknout

# renameHint
source: New name
cs: Nový název

# newDirectoryHint
source: Folder name
cs: Název složky

# newNoteHint
source: Note name
cs: Název poznámky

# synchronizingStart
source: Synchronizing data...
cs: Synchronizování dat...

# synchronizingSuccess
source: Data synchronized
cs: Data synchronizována

# synchronizingFailed
source: Error during synchronizing
cs: Při synchronizování se naskytla chyba

# synchronizationConflict
source: Possible conflict saved in Settings->Conflicts.
cs: Možné konflikty byly uloženy do Nastavení->Konflikty.

source: No conflicts
cs: Žádné konflikty

# manual
source: Application manual
cs: Manuál k aplikaci

# manualTitle
source: App manual
cs: Manuál

# deleteUserDataTitle
source: Delete account data
cs: Smazat uživatelská data?

# deleteUserDataContent
source: Do you want to delete data connected with account after log out?
cs: Chcete z tohoto zařízení smazat data, která jsou spojena s tímto účtem?
